sebanc/brunch/external-drivers/rtl8723du/core/rtw_mlme_ext.c
	memset(pmlmeinfo->chg_txt, 0, 128);

	pmlmeinfo->slotTime = SHORT_SLOT_TIME;
	pmlmeinfo->preamble_mode = PREAMBLE_AUTO;

	pmlmeinfo->dialogToken = 0;

	pmlmeext->action_public_rxseq = 0xffff;
	pmlmeext->action_public_dialog_token = 0xff;
}

static void init_mlme_ext_timer(struct adapter *adapt)
{
	struct	mlme_ext_priv *pmlmeext = &adapt->mlmeextpriv;

#if LINUX_VERSION_CODE >= KERNEL_VERSION(4, 15, 0)
	timer_setup(&pmlmeext->survey_timer, survey_timer_hdl, 0);
	timer_setup(&pmlmeext->link_timer, link_timer_hdl, 0);
#ifdef CONFIG_RTW_80211R
	timer_setup(&pmlmeext->ft_link_timer, rtw_ft_link_timer_hdl, 0);
	timer_setup(&pmlmeext->ft_roam_timer, rtw_ft_roam_timer_hdl, 0);
#endif

#else
	rtw_init_timer(&pmlmeext->survey_timer, adapt, survey_timer_hdl, adapt);
	rtw_init_timer(&pmlmeext->link_timer, adapt, link_timer_hdl, adapt);
#ifdef CONFIG_RTW_80211R
	rtw_init_timer(&pmlmeext->ft_link_timer, adapt, rtw_ft_link_timer_hdl, adapt);
	rtw_init_timer(&pmlmeext->ft_roam_timer, adapt, rtw_ft_roam_timer_hdl, adapt);
#endif
#endif
}

int	init_mlme_ext_priv(struct adapter *adapt)
{
	int	res = _SUCCESS;
	struct registry_priv *pregistrypriv = &adapt->registrypriv;
	struct mlme_ext_priv *pmlmeext = &adapt->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);

	/* We don't need to memset adapt->XXX to zero, because adapter is allocated by vzalloc(). */
	/* memset((u8 *)pmlmeext, 0, sizeof(struct mlme_ext_priv)); */

	pmlmeext->adapt = adapt;

	/* fill_fwpriv(adapt, &(pmlmeext->fwpriv)); */

	init_mlme_ext_priv_value(adapt);
	pmlmeinfo->bAcceptAddbaReq = pregistrypriv->bAcceptAddbaReq;

	init_mlme_ext_timer(adapt);

	init_mlme_ap_info(adapt);

	pmlmeext->last_scan_time = 0;
	pmlmeext->mlmeext_init = true;

	pmlmeext->active_keep_alive_check = true;

	return res;
}

void free_mlme_ext_priv(struct mlme_ext_priv *pmlmeext)
{
	struct adapter *adapt = pmlmeext->adapt;

	if (!adapt)
		return;

	if (rtw_is_drv_stopped(adapt)) {
		_cancel_timer_ex(&pmlmeext->survey_timer);
		_cancel_timer_ex(&pmlmeext->link_timer);
	}
}

static void _mgt_dispatcher(struct adapter *adapt, struct mlme_handler *ptable, union recv_frame *precv_frame)
{
	u8 bc_addr[ETH_ALEN] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};
	u8 *pframe = precv_frame->u.hdr.rx_data;

	if (ptable->func) {
		/* receive the frames that ra(a1) is my address or ra(a1) is bc address. */
		if (memcmp(GetAddr1Ptr(pframe), adapter_mac_addr(adapt), ETH_ALEN) &&
		    memcmp(GetAddr1Ptr(pframe), bc_addr, ETH_ALEN))
			return;

		ptable->func(adapt, precv_frame);
	}

}

void mgt_dispatcher(struct adapter *adapt, union recv_frame *precv_frame)
{
	int index;
	struct mlme_handler *ptable;
	u8 bc_addr[ETH_ALEN] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};
	u8 *pframe = precv_frame->u.hdr.rx_data;
	struct sta_info *psta = rtw_get_stainfo(&adapt->stapriv, get_addr2_ptr(pframe));
	struct recv_priv  *precvpriv = &adapt->recvpriv;

	if (GetFrameType(pframe) != WIFI_MGT_TYPE)
		return;

	/* receive the frames that ra(a1) is my address or ra(a1) is bc address. */
	if (memcmp(GetAddr1Ptr(pframe), adapter_mac_addr(adapt), ETH_ALEN) &&
	    memcmp(GetAddr1Ptr(pframe), bc_addr, ETH_ALEN))
		return;

	ptable = mlme_sta_tbl;

	index = get_frame_sub_type(pframe) >> 4;

	if (index >= (sizeof(mlme_sta_tbl) / sizeof(struct mlme_handler))) {
		return;
	}
	ptable += index;

	if (psta) {
		if (GetRetry(pframe)) {
			if (le16_to_cpu(precv_frame->u.hdr.attrib.seq_num) ==
			    psta->RxMgmtFrameSeqNum) {
				/* drop the duplicate management frame */
				precvpriv->dbg_rx_dup_mgt_frame_drop_count++;
				RTW_INFO("Drop duplicate management frame with seq_num = %d.\n",
					 precv_frame->u.hdr.attrib.seq_num);
				return;
			}
		}
		psta->RxMgmtFrameSeqNum = le16_to_cpu(precv_frame->u.hdr.attrib.seq_num);
	}

	switch (get_frame_sub_type(pframe)) {
	case WIFI_AUTH:
		if (MLME_IS_AP(adapt))
			ptable->func = &OnAuth;
		else
			ptable->func = &OnAuthClient;
		__attribute__((__fallthrough__));
	case WIFI_ASSOCREQ:
	case WIFI_REASSOCREQ:
		_mgt_dispatcher(adapt, ptable, precv_frame);
		break;
	case WIFI_PROBEREQ:
		_mgt_dispatcher(adapt, ptable, precv_frame);
		break;
	case WIFI_BEACON:
		_mgt_dispatcher(adapt, ptable, precv_frame);
		break;
	case WIFI_ACTION:
		_mgt_dispatcher(adapt, ptable, precv_frame);
		break;
	default:
		_mgt_dispatcher(adapt, ptable, precv_frame);
		break;
	}
}

static u32 p2p_listen_state_process(struct adapter *adapt, unsigned char *da)
{
	bool response = true;

	if (adapt->wdinfo.driver_interface == DRIVER_CFG80211) {
		if (!rtw_cfg80211_get_is_roch(adapt) ||
		    rtw_get_oper_ch(adapt) !=
				 adapt->wdinfo.listen_channel ||
		    !adapter_wdev_data(adapt)->p2p_enabled ||
		    !adapt->mlmepriv.wps_probe_resp_ie ||
		    !adapt->mlmepriv.p2p_probe_resp_ie) {
			response = false;
		}
	} else
		if (adapt->wdinfo.driver_interface == DRIVER_WEXT) {
			/*	do nothing if the device name is empty */
			if (!adapt->wdinfo.device_name_len)
				response	= false;
		}

	if (response)
		issue_probersp_p2p(adapt, da);

	return _SUCCESS;
}


/****************************************************************************

Following are the callback functions for each subtype of the management frames

*****************************************************************************/

unsigned int OnProbeReq(struct adapter *adapt, union recv_frame *precv_frame)
{
	unsigned int	ielen;
	unsigned char	*p;
	struct mlme_priv *pmlmepriv = &adapt->mlmepriv;
	struct mlme_ext_priv *pmlmeext = &adapt->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	struct wlan_bssid_ex	*cur = &(pmlmeinfo->network);
	u8 *pframe = precv_frame->u.hdr.rx_data;
	uint len = precv_frame->u.hdr.len;
	u8 is_valid_p2p_probereq = false;

	struct wifidirect_info	*pwdinfo = &(adapt->wdinfo);
	struct rx_pkt_attrib	*pattrib = &precv_frame->u.hdr.attrib;
	u8 wifi_test_chk_rate = 1;

	if ((pwdinfo->driver_interface == DRIVER_CFG80211)
	    && !rtw_p2p_chk_state(pwdinfo, P2P_STATE_NONE)
	    && (GET_CFG80211_REPORT_MGMT(adapter_wdev_data(adapt), IEEE80211_STYPE_PROBE_REQ))
	) {
		rtw_cfg80211_rx_probe_request(adapt, precv_frame);
		return _SUCCESS;
	}

