sebanc/brunch/external-drivers/rtl8723du/core/rtw_mlme_ext.c
		psta->htpriv.ampdu_enable = pmlmepriv->htpriv.ampdu_enable;

		psta->htpriv.rx_ampdu_min_spacing = (pmlmeinfo->HT_caps.u.HT_cap_element.AMPDU_para & IEEE80211_HT_CAP_AMPDU_DENSITY) >> 2;

		if (support_short_GI(adapt, &(pmlmeinfo->HT_caps), CHANNEL_WIDTH_20))
			psta->htpriv.sgi_20m = true;

		if (support_short_GI(adapt, &(pmlmeinfo->HT_caps), CHANNEL_WIDTH_40))
			psta->htpriv.sgi_40m = true;

		psta->qos_option = true;

		psta->htpriv.ldpc_cap = pmlmepriv->htpriv.ldpc_cap;
		psta->htpriv.stbc_cap = pmlmepriv->htpriv.stbc_cap;
		psta->htpriv.beamform_cap = pmlmepriv->htpriv.beamform_cap;

		memcpy(&psta->htpriv.ht_cap, &pmlmeinfo->HT_caps, sizeof(struct rtw_ieee80211_ht_cap));
	} else {
		psta->htpriv.ht_option = false;
		psta->htpriv.ampdu_enable = false;
		psta->htpriv.tx_amsdu_enable = false;
		psta->htpriv.sgi_20m = false;
		psta->htpriv.sgi_40m = false;
		psta->qos_option = false;

	}

	psta->htpriv.ch_offset = pmlmeext->cur_ch_offset;

	psta->htpriv.agg_enable_bitmap = 0x0;/* reset */
	psta->htpriv.candidate_tid_bitmap = 0x0;/* reset */

	psta->cmn.bw_mode = pmlmeext->cur_bwmode;

	/* QoS */
	if (pmlmepriv->qospriv.qos_option)
		psta->qos_option = true;

	psta->cmn.ra_info.is_support_sgi = query_ra_short_GI(psta, rtw_get_tx_bw_mode(adapt, psta));
	update_ldpc_stbc_cap(psta);

	_enter_critical_bh(&psta->lock, &irqL);
	psta->state = _FW_LINKED;
	_exit_critical_bh(&psta->lock, &irqL);

}

static void rtw_mlmeext_disconnect(struct adapter *adapt)
{
	struct mlme_priv		*pmlmepriv = &adapt->mlmepriv;
	struct mlme_ext_priv	*pmlmeext = &adapt->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	u8 self_action = MLME_ACTION_UNKNOWN;
	u8 state_backup = (pmlmeinfo->state & 0x03);
	u8 ASIX_ID[] = {0x00, 0x0E, 0xC6};

	if (MLME_IS_AP(adapt))
		self_action = MLME_AP_STOPPED;
	else if (MLME_IS_MESH(adapt))
		self_action = MLME_MESH_STOPPED;
	else if (MLME_IS_STA(adapt))
		self_action = MLME_STA_DISCONNECTED;
	else if (MLME_IS_ADHOC(adapt) || MLME_IS_ADHOC_MASTER(adapt))
		self_action = MLME_ADHOC_STOPPED;
	else if (MLME_IS_NULL(adapt))
		self_action = MLME_ACTION_NONE;
	else {
		RTW_INFO("state:0x%x\n", MLME_STATE(adapt));
		rtw_warn_on(1);
	}

	/* set_opmode_cmd(adapt, infra_client_with_mlme); */

	rtw_hal_set_hwreg(adapt, HW_VAR_MLME_DISCONNECT, NULL);
	rtw_hal_set_hwreg(adapt, HW_VAR_BSSID, null_addr);

	/* set MSR to no link state->infra. mode */
	Set_MSR(adapt, _HW_STATE_STATION_);

	/* check if sta is ASIX peer and fix IOT issue if it is. */
	if (!memcmp(get_my_bssid(&pmlmeinfo->network) , ASIX_ID , 3)) {
		u8 iot_flag = false;
		rtw_hal_set_hwreg(adapt, HW_VAR_ASIX_IOT, (u8 *)(&iot_flag));
	}
	pmlmeinfo->state = WIFI_FW_NULL_STATE;

	if (state_backup == WIFI_FW_STATION_STATE) {
		if (rtw_port_switch_chk(adapt)) {
			rtw_hal_set_hwreg(adapt, HW_VAR_PORT_SWITCH, NULL);
			{
				struct adapter *port0_iface = dvobj_get_port0_adapter(adapter_to_dvobj(adapt));
				if (port0_iface)
					rtw_lps_ctrl_wk_cmd(port0_iface, LPS_CTRL_CONNECT, 0);
			}
		}
	}

	/* switch to the 20M Hz mode after disconnect */
	pmlmeext->cur_bwmode = CHANNEL_WIDTH_20;
	pmlmeext->cur_ch_offset = HAL_PRIME_CHNL_OFFSET_DONT_CARE;

#ifdef CONFIG_FCS_MODE
	if (EN_FCS(adapt))
		rtw_hal_set_hwreg(adapt, HW_VAR_STOP_FCS_MODE, NULL);
#endif
	{
		u8 ch, bw, offset;

		if (rtw_mi_get_ch_setting_union_no_self(adapt, &ch, &bw, &offset) != 0) {
			set_channel_bwmode(adapt, ch, offset, bw);
			rtw_mi_update_union_chan_inf(adapt, ch, offset, bw);
		}
	}

	flush_all_cam_entry(adapt);

	_cancel_timer_ex(&pmlmeext->link_timer);

	pmlmepriv->LinkDetectInfo.TrafficTransitionCount = 0;
	pmlmepriv->LinkDetectInfo.LowPowerTransitionCount = 0;
}

void mlmeext_joinbss_event_callback(struct adapter *adapt, int join_res)
{
	struct sta_info		*psta;
	struct mlme_ext_priv	*pmlmeext = &adapt->mlmeextpriv;
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	struct wlan_bssid_ex		*cur_network = &(pmlmeinfo->network);
	struct sta_priv		*pstapriv = &adapt->stapriv;
	u8	join_type;
#ifdef CONFIG_ARP_KEEP_ALIVE
	struct mlme_priv	*pmlmepriv = &adapt->mlmepriv;
#endif

	if (join_res < 0) {
		join_type = 1;
		rtw_hal_set_hwreg(adapt, HW_VAR_MLME_JOIN, (u8 *)(&join_type));
		rtw_hal_set_hwreg(adapt, HW_VAR_BSSID, null_addr);

		goto exit_mlmeext_joinbss_event_callback;
	}
#ifdef CONFIG_ARP_KEEP_ALIVE
	pmlmepriv->bGetGateway = 1;
	pmlmepriv->GetGatewayTryCnt = 0;
#endif

	if ((pmlmeinfo->state & 0x03) == WIFI_FW_ADHOC_STATE) {
		/* update bc/mc sta_info */
		update_bmc_sta(adapt);
	}


	/* turn on dynamic functions */
	/* Switch_DM_Func(adapt, DYNAMIC_ALL_FUNC_ENABLE, true); */

	/* update IOT-releated issue */
	update_IOT_info(adapt);

	rtw_hal_set_hwreg(adapt, HW_VAR_BASIC_RATE, cur_network->SupportedRates);

	/* BCN interval */
	rtw_hal_set_hwreg(adapt, HW_VAR_BEACON_INTERVAL, (u8 *)(&pmlmeinfo->bcn_interval));

	/* udpate capability */
	update_capinfo(adapt, pmlmeinfo->capability);

	/* WMM, Update EDCA param */
	WMMOnAssocRsp(adapt);

	/* HT */
	HTOnAssocRsp(adapt);

	psta = rtw_get_stainfo(pstapriv, cur_network->MacAddress);
	if (psta) { /* only for infra. mode */
		psta->wireless_mode = pmlmeext->cur_wireless_mode;

#ifdef CONFIG_FW_MULTI_PORT_SUPPORT
		rtw_hal_set_default_port_id_cmd(adapt, psta->cmn.mac_id);
#endif

		/* set per sta rate after updating HT cap. */
		set_sta_rate(adapt, psta);

		rtw_sta_media_status_rpt(adapt, psta, 1);

		/* wakeup macid after join bss successfully to ensure
			the subsequent data frames can be sent out normally */
		rtw_hal_macid_wakeup(adapt, psta->cmn.mac_id);
	}
	if (rtw_port_switch_chk(adapt))
		rtw_hal_set_hwreg(adapt, HW_VAR_PORT_SWITCH, NULL);

	join_type = 2;
	rtw_hal_set_hwreg(adapt, HW_VAR_MLME_JOIN, (u8 *)(&join_type));

	if ((pmlmeinfo->state & 0x03) == WIFI_FW_STATION_STATE) {
		/* correcting TSF */
		correct_TSF(adapt, pmlmeext);
	}
	rtw_lps_ctrl_wk_cmd(adapt, LPS_CTRL_CONNECT, 0);

exit_mlmeext_joinbss_event_callback:

	rtw_join_done_chk_ch(adapt, join_res);
	RTW_INFO("=>%s - End to Connection without 4-way\n", __func__);
}

/* currently only adhoc mode will go here */
void mlmeext_sta_add_event_callback(struct adapter *adapt, struct sta_info *psta)
{
	struct mlme_ext_priv	*pmlmeext = &(adapt->mlmeextpriv);
	struct mlme_ext_info	*pmlmeinfo = &(pmlmeext->mlmext_info);
	u8	join_type;

